package kr.ac.kopo.week1.day04;

public class ExamMain01 {

	public static void main(String[] args) {
		/* 1. 3개의 정수를 입력받아 큰수에서 작은수 순으로 출력
		 * 3개의 정수를 입력하세요 : 12 7 39
		 * 
		 * 2. 4개의 정수를 입력받아 가장 큰 수를 출력
		 * 4개의 정수를 입력하세요 : 12 6 2 54
		 * 가장 큰수 : 54
		 * 
		 * 3. 달팽이가 100m 깊이의 우물에 빠졌습니다.
		 * 딜팽이는 한시간에 5m의 속도로 우물을 기어오릅니다.
		 * 올라간 높이가 50m미만일 때는 한시간에 1m씩 미끌어지고
		 * 올라간 높이가 50m이상일 때는 한시간에 2m씩 미끌어집니다.
		 * 달팽이는 몇시간만에 우물을 탈출할까요?
		 * 
		 * [1시간후] 달팽이가 올라간 총 높이:
		 * 
		 * 4. 1과 자기자신 외에는 약수가 존재하지 않는 양의 정수
		 * 정수를 입력 : 23
		 * 23은 소수입니다.
		 * 
		 * 정수를 입력하세요 : 12
		 * 12는 소수가 아닙니다.
		 * 
		 * 5. 2~100 사이의 소수를 출력
		 * 2 3 5 7 11
		 * 13 17 ...
		 * 
		 * <배열>
		 * 6. 10개의 정수를 입력받아 다음과 같이 출력하는 코드를 작성
		 * 1st 정수 : 12 
		 * 2nd 정수 : 3 
		 * 3th 정수 : 1
		 * ...
		 * 10th 정수 : 4
		 * 
		 * <짝수>
		 * 12 4 ...
		 * <홀수?
		 * 3 1 ...
		 *  
		 */

	}

}
